<?php

	namespace Proj\Site\Templates\General;

	use Base\Templates\Template;
	use Proj\Site\Params;
	use Proj\Site\Units\General;

	abstract class PrivacyPolicy {

		public static function ToVar(): string {
			Template::Start();
			self::Render();
			return Template::Read();
		}

		public static function Render(): void { ?>
			<div class = "view documents privacy_policy">
				<div class = "grid col_1">
					<div>
						<h1>Политика конфиденциальности</h1>
						<ol>
							<li>
								Общие положения политики
								<ol>
									<li>Настоящая Политика конфиденциальности (далее именуемая «Политика») сайта <?= Params::$site_address; ?> и/или мобильного приложения (далее именуемые «Приложение») представляет собой правила получения, использования, хранения и защиты персональных данных пользователя (физическое или юридическое лицо) Приложения (далее - «Пользователь») и действует в отношении всех персональных данных Пользователя (далее - «Данные»), которые администрация Приложения (далее - «Администратор») может получить от Пользователя.</li>
									<li>Функции Администратора Приложения выполняет его владелец.</li>
									<li>Администратор вправе вносить изменения или дополнения в настоящую Политику без уведомления пользователя. Новая Политика конфиденциальности вступает в силу с момента её размещения в Приложении, если иное не предусмотрено новой редакцией Политики конфиденциальности.</li>
								</ol>
							</li>
							<li>
								Персональные данные, предоставляемые пользователем
								<ol>
									<li>
										Под персональными данными в настоящей Политике понимаются:
										<ul>
											<li>информация, предоставляемая Пользователем самостоятельно, включая персональные данные Пользователя: фамилия, имя, отчество, электронная почта, телефон, адрес и другие данные.</li>
											<li>Данные которые предоставляются в автоматическом режиме (IP-адреса, файлы cookies и т.п.).</li>
											<li>статистическая информация, в том числе информация о сеансе, включая время отклика страницы, продолжительность посещений определенных страниц, информация о взаимодействии со страницами.</li>
										</ul>
									</li>
									<li>Пользуясь Приложением Пользователь обязуется предоставлять только достоверные данные и несёт ответственность за предоставленную им информацию.</li>
									<li>Пользуясь Приложением и передавая данные Приложению, Пользователь своей волей и в своих интересах даёт согласие на все способы обработки своих Данных, в том числе: сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передача (распространение, предоставление доступа), обезличивание, блокирование, удаление, уничтожение.</li>
									<li>Администратор не обязан проверять достоверность получаемой (собираемой) информации о Пользователе. Если пользователь внесёт ложную, оскорбительную для других пользователей или недостоверную информацию, Администратор вправе заблокировать аккаунт Пользователя или отказать Пользователю в дальнейшем использовании Приложения, всеми доступными для Администратора средствами, без какого-либо возвращения возможных потерь Пользователя. Также Администратор вправе заблокировать аккаунт Пользователя в случае подозрений на мошеннические действия, как со стороны пользователя, так и против него без какого-либо возмещения возможных потерь Пользователя.</li>
									<li>В процессе пользования Приложением (в том числе при регистрации, размещении персональной информации в специализированных разделах и т.п.), Пользователь самостоятельно и добровольно принимает решение о предоставлении Приложению Данных.</li>
									<li>Пользователь заявляет о своём согласии на обработку Администратором и его аффилированными лицами Данных Пользователя, их передачу (в том числе трансграничную передачу на территорию иностранных государств, обеспечивающих защиту прав субъектов персональных данных) для обработки другим Пользователям и/или третьим лицам, действующих по поручению Администратора, в том числе для целей: предоставления консультационной поддержки Пользователям в связи с использованием Приложения, проверки размещаемой в Приложении информации на предмет соответствия <?= General::instance()->terms_use->GetLink('Пользовательскому соглашению'); ?> и иным правилам и соглашениям размещённых в Приложении, получения статистических и аналитических данных, получения рассылок рекламно-информационного характера Приложения или третьих лиц, обеспечения соблюдения требований действующего законодательства Российской Федерации. Администратор принимает все необходимые меры для защиты персональных данных Пользователя от несанкционированного доступа третьих лиц.</li>
									<li>Вся информация (независимо от того относится ли такая информация законодательством Российской Федерации к персональным или иным данным, подлежащим защите в соответствии с законодательством Российской Федерации, или нет), размещённая Пользователем в Приложении, размещаемая им в специальных разделах Приложения публикуется в открытом доступе, то есть доступна для ознакомления любому Пользователю Приложения (неограниченному кругу лиц) на территории всех стран мира, где имеется возможность использования сети Интернет и доступ к Приложению. Соответственно, Пользователь понимает и принимает на себя все риски, связанные с таким размещением информации, в том числе, включая, но не ограничиваясь: риск попадания адреса электронной почты в списки для рассылки спам-сообщений, риск попадания телефонного номера к SMS-спамерам и/или SMS-мошенникам и иные риски, вытекающие из такого размещения информации. Администратор и Приложение не несёт ответственности за убытки или потери Пользователя, которые могут возникнуть при размещении Данных в Приложении.</li>
									<li>Администратор не обязан осуществлять предварительную проверку информации любого вида, размещаемой и/или распространяемой Пользователем посредством Приложения. Администратор имеет право по своему усмотрению отказать Пользователю в размещении и/или распространении им любой информации или удалить любые данные, которые размещены Пользователем в Приложении. Пользователь осознаёт и согласен с тем, что он должен самостоятельно оценивать все риски, связанные с размещением и распространением любых сведений, включая оценку надёжности, полноты или полезности такового.</li>
								</ol>
							</li>
							<li>
								Цели обработки персональных данных
								<ol>
									<li>Приложение собирает и хранит только ту персональную информацию, которая необходима для указанных ниже целей, а также исполнения соглашений и договоров с Пользователем, за исключением случаев, когда законодательством предусмотрено обязательное хранение персональной информации в течение определённого законом срока.</li>
									<li>
										Персональную информацию Пользователя Администратор обрабатывает в следующих целях:
										<ul>
											<li>идентификация стороны в рамках сервисов, соглашений и договоров;</li>
											<li>связь с Пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования Приложения, исполнения соглашений и договоров, а также обработка запросов и заявок от Пользователя;</li>
											<li>улучшения качества Приложения, удобства его использования, разработка новых продуктов;</li>
											<li>таргетирование рекламных материалов;</li>
											<li>проведение статистических и иных исследований, на основе обезличенных данных;</li>
											<li>для осуществления прав и законных интересов Приложения и/или третьих лиц;</li>
											<li>для достижения общественно значимых целей, в том числе для целей обеспечения достоверности информации, размещаемой Пользователем в Приложении, а также возможности идентификации Пользователей, размещающих такую информацию.</li>
										</ul>
									</li>
									<li>Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.</li>
								</ol>
							</li>
							<li>
								Защита персональной информации
								<ol>
									<li>Приложение принимает необходимые и достаточные организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.</li>
									<li>Приложение не несёт ответственность за сайты или приложения третьих лиц, на которые Пользователь может перейти по ссылкам, доступным в Приложении. В случае несогласия Пользователя с условиями настоящей Политики, Пользователь обязуется не передавать и не вносить в Приложение какие-либо Данные или информацию.</li>
								</ol>
							</li>
							<li>
								Изменение и отзыв Персональной информации
								<ol>
									<li>Согласие на обработку персональных данных может быть отозвано Пользователем в любой момент. Для реализации права на отзыв пользователь должен направить соответствующее обращение на адрес <?= Params::$support; ?>.</li>
									<li>Персональные данные Пользователя уничтожаются при желании самого пользователя на основании его обращения, либо по инициативе Администратора без объяснения причин путём удаления Администратором информации, размещённой Пользователем.</li>
									<li>Персональные данные Пользователя не передаются третьим лицам, за исключением случаев, предусмотренных законодательством Российской Федерации или для исполнения обязанностей по указанию услуг Пользователю, предполагающих для этого передачу Данных третьим лицам. Предоставление персональных данных Пользователя по запросу государственных органов, органов местного самоуправления осуществляется в порядке, предусмотренном законодательством Российской Федерации.</li>
								</ol>
							</li>
						</ol>
					</div>
				</div>
			</div>
		<?php }

	}